backend/app/models/user.rb

    def self.find_by_credentials(credential, password)
      user = nil
      if URI::MailTo::EMAIL_REGEXP.match?(credential)
        # debugger
        user = User.find_by(email: credential, password: password)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Demo-lition@user.com"], ["LIMIT", 1]]

    def reset_session_token!
      self.session_token = self.class.generate_session_token
      self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-08 22:02:08.122989"], ["id", 55]]

    def generate_unique_session_token
      token = SecureRandom::urlsafe_base64(16)
      while User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]