backend/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-10 16:20:40.310612"], ["id", 1]]
---
    def reset_session_token!
      self.session_token = generate_unique_session_token
      # debugger
      self.save!

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
      token = SecureRandom::urlsafe_base64(16)
      while User.exists?(session_token: token)