backend/app/controllers/api/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        @restaurants = Restaurant.find(params[:id])