backend/app/controllers/api/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
   def index
    if params[:restaurant_id]
      @reviews = Review.where(restaurant_id: params[:restaurant_id])
    else
      @reviews = Review.all

INSERT INTO "reviews" ("nickname", "body", "overall", "food", "service", "ambience", "value", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        @review = Review.new(review_params)

        if @review.save