backend/app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "phone_number", "review_display_name", "session_token", "primary_dining_location", "dietary_preferences", "special_requests", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save